
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10031357930)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> "functions/src_2699b27d389cc25849670d6a1cb5be4b.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> "functions/src_2699b27d389cc25849670d6a1cb5be4b.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> "functions/src_2699b27d389cc25849670d6a1cb5be4b.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "KE2H2g==" -> (known after apply)
      ~ detect_md5hash      = "BbPvOYPs0/X4TerSA1b/lA==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "BbPvOYPs0/X4TerSA1b/lA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_05b3ef3983ecd3f5f84dead20356ff94.zip?generation=1721479256160502&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> "functions/src_2699b27d389cc25849670d6a1cb5be4b.zip" # forces replacement
      ~ output_name         = "functions/src_05b3ef3983ecd3f5f84dead20356ff94.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_05b3ef3983ecd3f5f84dead20356ff94.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1159,"Program":"tfcmt","SHA1":"e1607a599ee240a755dc8eb82294f69d687a0b36","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->